{
    "architectures": [
      "LecbertForPreTraining"
    ],
    "margin": 0.5,
    "num_labels": 7,
    "attention_probs_dropout_prob": 0.1,
    "bos_token_id": 0,
    "eos_token_id": 2,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 512,
    "initializer_range": 0.02,
    "intermediate_size": 2048,
    "layer_norm_eps": 1e-05,
    "max_position_embeddings": 258,
    "model_type": "lecbert",
    "num_attention_heads": 8,
    "num_hidden_layers": 4,
    "pad_token_id": 1,
    "type_vocab_size": 1,
    "vocab_size": 52000
}
